tesi-repo/openfoam/system/sampleDict
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                           |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox     |
|  \\    /   O peration     | Version:  2312                            |
|   \\  /    A nd           | Website:  www.openfoam.com                |
|    \\/     M anipulation  |                                           |
\*---------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            surfaces;
libs            (sampling);

surfaceFormat   raw;
interpolationScheme cellPoint;

fields          (U p);

surfaces
{
    pianoFisico
    {
        type            patch;
	patches 	(frontAndBack);
    }
}
