tesi-repo/openfoam/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    pianoCentraleSet;
        type    cellSet;
        action  clear;
    }
    {
        name    pianoCentraleSet;
        type    cellSet;
        action  add;
        source  boxToCell;
	box     (0 0 0.013333) (1 1 0.026666);
    }
    {
        name    pianoCentraleZone;
        type    cellZoneSet;
        action  clear;
    }
    {
        name    pianoCentraleZone;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     pianoCentraleSet;
    }
);
